@mmathewdtx  Currently monitor argument supports  single monitor, multiple monitors “http and https”, or a “min” rule, “min 1 of { http https }”. 

So for your usecase we can use min rule to specify atleast 1 of  confugured health monitors

```

resource "bigip_ltm_monitor" "monitor" {
  name        = "/Common/terraform_monitor"
  parent      = "/Common/http"
  send        = "GET /some/path\r\n"
  timeout     = "999"
  interval    = "999"
  destination = "1.2.3.4:1234"
}

resource "bigip_ltm_monitor" "test-ftp-monitor" {
  name          = "/Common/ftp-test"
  parent        = "/Common/ftp"
  interval      = 5
  time_until_up = 0
  timeout       = 16
  destination   = "*:8008"
  filename      = "somefile"
}


resource "bigip_ltm_pool" "pool" {
  name                      = "/Common/Axiom_Environment_APP1_Pool"
  load_balancing_mode       = "round-robin"
  minimum_active_members = 1
  monitors                  = list( format( "min 1 of %s %s",bigip_ltm_monitor.monitor.name, bigip_ltm_monitor.test-ftp-monitor.name ))
}

```

```
HYD-ML-00064439:terraform-provider-bigip papineni$ terraform apply

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # bigip_ltm_monitor.monitor will be created
  + resource "bigip_ltm_monitor" "monitor" {
      + adaptive       = (known after apply)
      + adaptive_limit = (known after apply)
      + compatibility  = "enabled"
      + destination    = "1.2.3.4:1234"
      + id             = (known after apply)
      + interval       = 999
      + ip_dscp        = (known after apply)
      + manual_resume  = (known after apply)
      + mode           = (known after apply)
      + name           = "/Common/terraform_monitor"
      + parent         = "/Common/http"
      + reverse        = (known after apply)
      + send           = "GET /some/path\\r\\n"
      + time_until_up  = (known after apply)
      + timeout        = 999
      + transparent    = (known after apply)
      + up_interval    = (known after apply)
    }

  # bigip_ltm_monitor.test-ftp-monitor will be created
  + resource "bigip_ltm_monitor" "test-ftp-monitor" {
      + adaptive       = (known after apply)
      + adaptive_limit = (known after apply)
      + compatibility  = "enabled"
      + destination    = "*:8008"
      + filename       = "somefile"
      + id             = (known after apply)
      + interval       = 5
      + ip_dscp        = (known after apply)
      + manual_resume  = (known after apply)
      + mode           = (known after apply)
      + name           = "/Common/ftp-test"
      + parent         = "/Common/ftp"
      + reverse        = (known after apply)
      + send           = (known after apply)
      + time_until_up  = 0
      + timeout        = 16
      + transparent    = (known after apply)
      + up_interval    = (known after apply)
    }

  # bigip_ltm_pool.pool will be created
  + resource "bigip_ltm_pool" "pool" {
      + allow_nat              = (known after apply)
      + allow_snat             = (known after apply)
      + id                     = (known after apply)
      + load_balancing_mode    = "round-robin"
      + minimum_active_members = 1
      + monitors               = [
          + "min 1 of /Common/terraform_monitor /Common/ftp-test",
        ]
      + name                   = "/Common/Axiom_Environment_APP1_Pool"
      + reselect_tries         = (known after apply)
      + service_down_action    = (known after apply)
      + slow_ramp_time         = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

bigip_ltm_monitor.test-ftp-monitor: Creating...
bigip_ltm_monitor.monitor: Creating...
bigip_ltm_monitor.test-ftp-monitor: Creation complete after 4s [id=/Common/ftp-test]
bigip_ltm_monitor.monitor: Creation complete after 4s [id=/Common/terraform_monitor]
bigip_ltm_pool.pool: Creating...
bigip_ltm_pool.pool: Creation complete after 1s [id=/Common/Axiom_Environment_APP1_Pool]

Apply complete! Resources: 3 added, 0 changed, 0 destroyed.
HYD-ML-00064439:terraform-provider-bigip papineni$ 
```

Let me know if this works out for you.  I will also update examples to have these use cases in documentation


